read_verilog -sv rtl/mux2to1.sv
read_verilog -sv rtl/adder.sv
read_verilog -sv rtl/data_register.sv
read_verilog -sv rtl/register_bank.sv
read_verilog -sv rtl/bit_counter.sv
read_verilog -sv rtl/controller_fsm.sv
read_verilog -sv rtl/montgomery_datapath.sv
read_verilog -sv rtl/cond_sub.sv
read_verilog -sv rtl/montgomery_engine.sv

hierarchy -top montgomery_engine

show -format dot -prefix montgomery_engine
